espressif/esp-idf/components/soc/esp32h21/register/soc/soc_etm_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Configuration Register */
/** Type of ch_ena_ad0 register
 *  Channel enable status register
 */
typedef union {
    struct {
        /** ch_enabled0 : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents channel0 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled0:1;
        /** ch_enabled1 : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents channel1 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled1:1;
        /** ch_enabled2 : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents channel2 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled2:1;
        /** ch_enabled3 : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents channel3 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled3:1;
        /** ch_enabled4 : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents channel4 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled4:1;
        /** ch_enabled5 : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents channel5 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled5:1;
        /** ch_enabled6 : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents channel6 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled6:1;
        /** ch_enabled7 : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents channel7 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled7:1;
        /** ch_enabled8 : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents channel8 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled8:1;
        /** ch_enabled9 : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents channel9 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled9:1;
        /** ch_enabled10 : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents channel10 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled10:1;
        /** ch_enabled11 : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents channel11 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled11:1;
        /** ch_enabled12 : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents channel12 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled12:1;
        /** ch_enabled13 : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents channel13 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled13:1;
        /** ch_enabled14 : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents channel14 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled14:1;
        /** ch_enabled15 : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents channel15 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled15:1;
        /** ch_enabled16 : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents channel16 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled16:1;
        /** ch_enabled17 : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents channel17 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled17:1;
        /** ch_enabled18 : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents channel18 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled18:1;
        /** ch_enabled19 : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents channel19 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled19:1;
        /** ch_enabled20 : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents channel20 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled20:1;
        /** ch_enabled21 : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents channel21 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled21:1;
        /** ch_enabled22 : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents channel22 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled22:1;
        /** ch_enabled23 : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents channel23 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled23:1;
        /** ch_enabled24 : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents channel24 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled24:1;
        /** ch_enabled25 : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents channel25 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled25:1;
        /** ch_enabled26 : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents channel26 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled26:1;
        /** ch_enabled27 : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents channel27 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled27:1;
        /** ch_enabled28 : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents channel28 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled28:1;
        /** ch_enabled29 : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents channel29 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled29:1;
        /** ch_enabled30 : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents channel30 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled30:1;
        /** ch_enabled31 : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents channel31 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled31:1;
    };
    uint32_t val;
} soc_etm_ch_ena_ad0_reg_t;

