espressif/esp-idf/components/soc/esp32h21/register/soc/soc_etm_struct.h
/** Type of ch_ena_ad0_set register
 *  Channel enable register
 */
typedef union {
    struct {
        /** ch_enable0 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to enable channel0.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable0:1;
        /** ch_enable1 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to enable channel1.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable1:1;
        /** ch_enable2 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to enable channel2.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable2:1;
        /** ch_enable3 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to enable channel3.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable3:1;
        /** ch_enable4 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to enable channel4.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable4:1;
        /** ch_enable5 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to enable channel5.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable5:1;
        /** ch_enable6 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to enable channel6.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable6:1;
        /** ch_enable7 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to enable channel7.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable7:1;
        /** ch_enable8 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to enable channel8.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable8:1;
        /** ch_enable9 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to enable channel9.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable9:1;
        /** ch_enable10 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to enable channel10.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable10:1;
        /** ch_enable11 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to enable channel11.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable11:1;
        /** ch_enable12 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to enable channel12.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable12:1;
        /** ch_enable13 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to enable channel13.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable13:1;
        /** ch_enable14 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to enable channel14.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable14:1;
        /** ch_enable15 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to enable channel15.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable15:1;
        /** ch_enable16 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to enable channel16.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable16:1;
        /** ch_enable17 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to enable channel17.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable17:1;
        /** ch_enable18 : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to enable channel18.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable18:1;
        /** ch_enable19 : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to enable channel19.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable19:1;
        /** ch_enable20 : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to enable channel20.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable20:1;
        /** ch_enable21 : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to enable channel21.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable21:1;
        /** ch_enable22 : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to enable channel22.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable22:1;
        /** ch_enable23 : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to enable channel23.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable23:1;
        /** ch_enable24 : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to enable channel24.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable24:1;
        /** ch_enable25 : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to enable channel25.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable25:1;
        /** ch_enable26 : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to enable channel26.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable26:1;
        /** ch_enable27 : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to enable channel27.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable27:1;
        /** ch_enable28 : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to enable channel28.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable28:1;
        /** ch_enable29 : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to enable channel29.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable29:1;
        /** ch_enable30 : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to enable channel30.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable30:1;
        /** ch_enable31 : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to enable channel31.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable31:1;
    };
    uint32_t val;
} soc_etm_ch_ena_ad0_set_reg_t;

/** Type of ch_ena_ad0_clr register
 *  Channel disable register
 */
typedef union {
    struct {
        /** ch_disable0 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to disable channel0.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable0:1;
        /** ch_disable1 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to disable channel1.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable1:1;
        /** ch_disable2 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to disable channel2.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable2:1;
        /** ch_disable3 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to disable channel3.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable3:1;
        /** ch_disable4 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to disable channel4.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable4:1;
        /** ch_disable5 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to disable channel5.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable5:1;
        /** ch_disable6 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to disable channel6.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable6:1;
        /** ch_disable7 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to disable channel7.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable7:1;
        /** ch_disable8 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to disable channel8.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable8:1;
        /** ch_disable9 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to disable channel9.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable9:1;
        /** ch_disable10 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to disable channel10.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable10:1;
        /** ch_disable11 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to disable channel11.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable11:1;
        /** ch_disable12 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to disable channel12.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable12:1;
        /** ch_disable13 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to disable channel13.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable13:1;
        /** ch_disable14 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to disable channel14.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable14:1;
        /** ch_disable15 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to disable channel15.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable15:1;
        /** ch_disable16 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to disable channel16.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable16:1;
        /** ch_disable17 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to disable channel17.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable17:1;
        /** ch_disable18 : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to disable channel18.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable18:1;
        /** ch_disable19 : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to disable channel19.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable19:1;
        /** ch_disable20 : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to disable channel20.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable20:1;
        /** ch_disable21 : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to disable channel21.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable21:1;
        /** ch_disable22 : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to disable channel22.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable22:1;
        /** ch_disable23 : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to disable channel23.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable23:1;
        /** ch_disable24 : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to disable channel24.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable24:1;
        /** ch_disable25 : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to disable channel25.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable25:1;
        /** ch_disable26 : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to disable channel26.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable26:1;
        /** ch_disable27 : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to disable channel27.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable27:1;
        /** ch_disable28 : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to disable channel28.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable28:1;
        /** ch_disable29 : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to disable channel29.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable29:1;
        /** ch_disable30 : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to disable channel30.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable30:1;
        /** ch_disable31 : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to disable channel31.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable31:1;
    };
    uint32_t val;
} soc_etm_ch_ena_ad0_clr_reg_t;

/** Type of ch_ena_ad1 register
 *  Channel enable status register
 */
typedef union {
    struct {
        /** ch_enabled32 : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents channel32 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled32:1;
        /** ch_enabled33 : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents channel33 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled33:1;
        /** ch_enabled34 : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents channel34 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled34:1;
        /** ch_enabled35 : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents channel35 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled35:1;
        /** ch_enabled36 : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents channel36 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled36:1;
        /** ch_enabled37 : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents channel37 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled37:1;
        /** ch_enabled38 : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents channel38 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled38:1;
        /** ch_enabled39 : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents channel39 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled39:1;
        /** ch_enabled40 : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents channel40 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled40:1;
        /** ch_enabled41 : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents channel41 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled41:1;
        /** ch_enabled42 : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents channel42 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled42:1;
        /** ch_enabled43 : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents channel43 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled43:1;
        /** ch_enabled44 : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents channel44 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled44:1;
        /** ch_enabled45 : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents channel45 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled45:1;
        /** ch_enabled46 : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents channel46 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled46:1;
        /** ch_enabled47 : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents channel47 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled47:1;
        /** ch_enabled48 : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents channel48 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled48:1;
        /** ch_enabled49 : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents channel49 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled49:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} soc_etm_ch_ena_ad1_reg_t;

/** Type of ch_ena_ad1_set register
 *  Channel enable register
 */
typedef union {
    struct {
        /** ch_enable32 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to enable channel32.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable32:1;
        /** ch_enable33 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to enable channel33.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable33:1;
        /** ch_enable34 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to enable channel34.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable34:1;
        /** ch_enable35 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to enable channel35.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable35:1;
        /** ch_enable36 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to enable channel36.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable36:1;
        /** ch_enable37 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to enable channel37.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable37:1;
        /** ch_enable38 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to enable channel38.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable38:1;
        /** ch_enable39 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to enable channel39.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable39:1;
        /** ch_enable40 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to enable channel40.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable40:1;
        /** ch_enable41 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to enable channel41.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable41:1;
        /** ch_enable42 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to enable channel42.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable42:1;
        /** ch_enable43 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to enable channel43.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable43:1;
        /** ch_enable44 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to enable channel44.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable44:1;
        /** ch_enable45 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to enable channel45.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable45:1;
        /** ch_enable46 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to enable channel46.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable46:1;
        /** ch_enable47 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to enable channel47.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable47:1;
        /** ch_enable48 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to enable channel48.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable48:1;
        /** ch_enable49 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to enable channel49.
         *  0: Invalid. No effect
         *  1: Enable
         */
        uint32_t ch_enable49:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} soc_etm_ch_ena_ad1_set_reg_t;

